const Q = [
  ["問題がありません", "もんだいがありません", 0],
  ["あいうえお", "あいうえお", 10],
  ["かきくけこ", "かきくけこ", 20],
  ["さしすせそ", "さしすせそ", 100],
  ["たちつてと", "たちつてと", 100],
  ["なにぬねの", "なにぬねの", 100],
  ["はひふへほ", "はひふへほ", 100],
  ["まみむめも", "まみむめも", 100],
  ["やゆよ", "やゆよ", 100],
  ["らりるれろ", "らりるれろ", 100],
  ["わをん", "わをん", 100],
  ["がぎぐげご", "がぎぐげご", 100],
  ["ざじずぜぞ", "ざじずぜぞ", 100],
  ["だぢづでど", "だぢづでど", 100],
  ["ばびぶべぼ", "ばびぶべぼ", 100],
  ["ぱぴぷぺぽ", "ぱぴぷぺぽ", 100],
  ["きゃきゅきょ", "きゃきゅきょ", 100],
  ["しゃしゅしょ", "しゃしゅしょ", 100],
  ["ちゃちゅちょ", "ちゃちゅちょ", 100],
  ["にゃにゅにょ", "にゃにゅにょ", 100],
  ["ひゃひゅひょ", "ひゃひゅひょ", 100],
  ["みゃみゅみょ", "みゃみゅみょ", 100],
  ["りゃりゅりょ", "りゃりゅりょ", 100],
  ["ぎゃぎゅぎょ", "ぎゃぎゅぎょ", 100],
  ["じゃじゅじょ", "じゃじゅじょ", 100],
  ["びゃびゅびょ", "びゃびゅびょ", 100],
  ["ぴゃぴゅぴょ", "ぴゃぴゅぴょ", 100],
  ["ふぁふゅふぉ", "ふぁふゅふぉ", 100],
  ["ゔぁゔゔぉ", "ゔぁゔゔぉ", 100],
  ["でぃ", "でぃ", 111],
  ["ジャコウ猫", "じゃこうねこ", 200],
  ["っくりん", "っくりん", 200],
];

export const getQuiz = (Q_used) => {
  //テスト用
  // return [Q[31], 0];

  //主題済みの問題を除いた一覧を作成
  const sp = Q_used.split(",");
  if (Q.length <= sp.length) {
    return [Q[0], 0];
  }
  while (true) {
    let flg = false;
    const Q_No = Math.floor(Math.random() * Q.length); //問題をランダムで出題する
    for (let key in sp) {
      if (Number(sp[key]) === Q_No) {
        flg = true;
      }
    }
    if (flg === false) {
      return [Q[Q_No], Q_No];
    }
  }
};
